predicate_options:list([], A, A).
predicate_options:list([A|B], [A|C], D) :-
    user:list(B, C, D).

:- dynamic list/2.

list(parent, ['Узумаки Наруто', 'Учиха Саске', 'Гаара', 'Харуно Сакура', 'Яманако Ино', 'Нара Шикамару', 'Темари']).
list(blond, ['Узумаки Наруто', 'Хатаки Какаши', 'Джирайя', 'Яманако Ино', 'Темари', 'Цунаде', 'Ооцуцуки Момошики', 'Намиказе Минато']).
list(uzumaki, ['Узумаки Наруто', 'Узумаки Кушина', 'Намиказе Минато', 'Узумаки Менма']).
list(female, ['Харуно Сакура', 'Яманако Ино', 'Темари', 'Теруми Мей', 'Шима', 'Цунаде', 'Узумаки Кушина', 'Конан']).
list(sharingan, ['Учиха Саске', 'Хатаки Какаши', 'Учиха Мадара']).
list(animal, ['Шима', 'Шукаку', 'Курама', 'Акамару']).
list(bidju, ['Шукаку', 'Курама']).
list(akatsuki, ['Орочимару', 'Джуго', 'Конан', 'Нагато']).
list(red, ['Гаара', 'Харуно Сакура', 'Теруми Мей', 'Узумаки Кушина', 'Джуго', 'Нагато']).
list(konoha, ['Узумаки Наруто', 'Учиха Саске', 'Хатаки Какаши', 'Орочимару', 'Учиха Мадара', 'Харуно Сакура', 'Джирайя', 'Майто Гай', 'Яманако Ино', 'Нара Шикамару', 'Цунаде', 'Узумаки Кушина', 'Курама', 'Инузука Киба', 'Акамару', 'Намиказе Минато', 'Узумаки Менма']).
list(sannin, ['Узумаки Наруто', 'Учиха Саске', 'Орочимару', 'Харуно Сакура', 'Джирайя', 'Цунаде']).
list(kage, ['Узумаки Наруто', 'Хатаки Какаши', 'Гаара', 'Теруми Мей', 'Цунаде', 'Намиказе Минато']).
list(old, ['Орочимару', 'Джирайя', 'Шима', 'Цунаде', 'Курама', 'Шукаку']).
list(beast, ['Узумаки Наруто', 'Учиха Саске', 'Хатаки Какаши', 'Орочимару', 'Гаара', 'Харуно Сакура', 'Джирайя', 'Темари', 'Цунаде', 'Инузука Киба', 'Намиказе Минато', 'Узумаки Менма']).
list(dead, ['Учиха Мадара', 'Джирайя', 'Узумаки Кушина', 'Ооцуцуки Момошики', 'Намиказе Минато', 'Конан', 'Нагато']).
list(characters, ['Узумаки Наруто', 'Учиха Саске', 'Хатаки Какаши', 'Орочимару', 'Учиха Мадара', 'Гаара', 'Харуно Сакура', 'Джирайя', 'Майто Гай', 'Яманака Ино', 'Нара Шикамару', 'Темари', 'Темури Мей', 'Шима', 'Шукаку', 'Цунаде', 'Узумаки Кушина', 'Курама', 'Джуго', 'Инузука Киба', 'Ооцуцуки Момошики', 'Акамару', 'Намиказе Минато', 'Узумаки Менма', 'Конан', 'Нагато']).

